v13/flowOverSphere/flowOverSphereSteady/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.1);

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           $internalField; //uniform (0 0 2);
    }

    outlet
    {

        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;

        //type            zeroGradient;

    }

    walls
    {
        // type            slip; // noSlip slip
        
        type            fixedValue;
        value           $internalField; //uniform (0 0 2);
    }

    sphere
    {
        type            noSlip;

        // type            fixedValue;
        // value           uniform (0 0 0);
    }
}

// ************************************************************************* //
