v13/flowOverSphere/flowOverSphereSteady/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
135432
(
(-5.48287e-18 -1.56394e-19 0)
(7.86503e-20 2.49444e-18 0)
(1.68222e-17 -2.22025e-17 0)
(-2.78383e-17 1.6863e-17 0)
(-1.66741e-17 1.35421e-17 0)
(1.11616e-17 -2.65028e-17 0)
(2.23004e-17 1.62151e-17 0)
(-1.66702e-17 -1.65955e-18 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
1600
(
(-5.48287e-18 -1.56394e-19 0)
(9.79832e-19 3.9305e-17 0)
(2.02938e-17 -1.07336e-19 0)
(2.99145e-18 -1.1348e-17 0)
(-3.91315e-18 1.67588e-17 0)
(-6.00341e-18 1.67575e-17 0)
(3.24818e-18 -1.13131e-17 0)
(1.23355e-17 -1.69022e-17 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
1600
(
(2.84267e-17 1.11453e-17 0)
(1.1107e-17 1.67788e-17 0)
(2.79807e-17 -1.07336e-19 0)
(-5.63543e-17 -1.1348e-17 0)
(-1.41491e-19 -2.25917e-17 0)
(2.7962e-17 -5.71922e-18 0)
(1.67205e-17 -3.37585e-17 0)
(-4.49509e-17 -2.25071e-17 0)
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
9600
(
(-5.48287e-18 -0 0)
(9.79832e-19 -0 0)
(2.02938e-17 -0 0)
(2.99145e-18 -0 0)
(-3.91315e-18 -0 0)
(-6.00341e-18 -0 0)
(3.24818e-18 -0 0)
(1.23355e-17 -0 0)
...
)
;
    }
    sphere
    {
        type            calculated;
        value           nonuniform List<vector> 
2792
(
(0.829356 -26.4093 0)
(26.4093 -0.829277 0)
(0.838541 -0.838556 0)
(-0.838548 0.838535 0)
(-0.838547 -0.838559 0)
(0.838516 0.83853 0)
(-26.4102 0.829732 0)
(-26.4102 -0.829822 0)
...
)
;
    }
}


// ************************************************************************* //
